        *>    RUN FILE:
        *>             cobc -x bernoulli.cbl
        *>             ./bernoulli
    
       IDENTIFICATION DIVISION.
       PROGRAM-ID. bernoulli.
       PROCEDURE DIVISION.
           DISPLAY "Hello, COBOL!".
           STOP RUN.
